@TomerHeber 

I recreated this without making any change. This is the code

```
terraform {
  required_providers {
    env0 = {
      source  = "env0/env0"
      version = "1.2.4"
    }
  }
}

resource "env0_environment" "aws-development-vault-elb-coralogix-s3-lambda" {
  name                       = "aws-development-vault-elb-coralogix-s3-lambda"
  project_id                 = "2e8094c9-8771-475e-83a0-23ce1999479e" # replace with your project
  approve_plan_automatically = true
  workspace                  = "aws-development-vault-elb-coralogix-s3-lambda"
  force_destroy              = true

  without_template_settings {
    repository        = "https://github.com/env0/templates"
    path              = "misc/null-resource"
    type              = "terraform"
    terraform_version = "1.2.9"
  }
}
```

On the second apply I get

```
env0_environment.aws-development-vault-elb-coralogix-s3-lambda: Refreshing state... [id=c7ce6072-cdf2-4d3f-a797-6c3827207404]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # env0_environment.aws-development-vault-elb-coralogix-s3-lambda must be replaced
-/+ resource "env0_environment" "aws-development-vault-elb-coralogix-s3-lambda" {
      - deploy_on_push                   = false -> null
      ~ deployment_id                    = "f7ff207b-ef11-4bcc-a918-e9691ba8a211" -> (known after apply)
      ~ id                               = "c7ce6072-cdf2-4d3f-a797-6c3827207404" -> (known after apply)
        name                             = "aws-development-vault-elb-coralogix-s3-lambda"
      ~ output                           = jsonencode({}) -> (known after apply)
      + revision                         = (known after apply)
      - run_plan_on_pull_requests        = false -> null
      - template_id                      = "66d895a6-dc11-48f9-b6d4-10e03b1d9f4a" -> null # forces replacement
        # (5 unchanged attributes hidden)

      ~ without_template_settings {
          - github_installation_id = 0 -> null
          - gitlab_project_id      = 0 -> null
          - retries_on_deploy      = 0 -> null
          - retries_on_destroy     = 0 -> null
          - ssh_keys               = [] -> null
            # (8 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

env0_environment.aws-development-vault-elb-coralogix-s3-lambda: Destroying... [id=c7ce6072-cdf2-4d3f-a797-6c3827207404]
env0_environment.aws-development-vault-elb-coralogix-s3-lambda: Destruction complete after 1s
env0_environment.aws-development-vault-elb-coralogix-s3-lambda: Creating...
env0_environment.aws-development-vault-elb-coralogix-s3-lambda: Creation complete after 2s [id=683a1590-04d4-45ef-999a-157fbfe397b4]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```

I guess something with the `template_id` is not handled correctly when calculating the plan?